# pandas: práctica y ejercicios

**NOTAS**
 - Hay muchas formas de resolver cada problema, encuentra la tuya.
 - Crea las celdas extra que necesites.
 - Recuerda que una celda puede ser de tipo Código, o de tipo Markdown. Utiliza las segundas para escribir texto y explicaciones si lo precisas.
 - Intenta crear variables a la hora de resolver los ejercicios.
 - Puedes apoyarte en internet: todos los programadores lo hacemos a diario.

<img width=500 src="https://upload.wikimedia.org/wikipedia/commons/3/31/TitanicBeken.jpg">

Importamos el csv del titanic a un dataframe

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("./datasets/titanic.csv")

Echa un vistazo a las primeras filas del dataframe

In [4]:
df.shape

(1309, 11)

In [5]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [14]:
df.sample(3)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1295,"Marvin, Mr. Daniel Warner",male,19.0,1,1,0,113773,53.1000,D30,S,0
221,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,1,0,11753,52.5542,D19,S,1
536,"Sobey, Mr. Samuel James Hayden",male,25.0,2,0,0,C.A. 29178,13.0000,NaN,S,0

Cuántos pasajeros hay en este dataframe?

In [19]:
df.shape[0]

1309

Cuáles son las columnas del dataframe?

In [29]:
df.columns

Index(['Name', 'Sex', 'Age', 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

Cuál es la edad media de los pasajeros? Y la mediana? Cómo interpretas el resultado?

In [31]:
df.Age.mean().round(1)

29.9

In [32]:
df.Age.median().round(1)

28.0

Cuánto costó el billete más caro?

In [35]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [37]:
df.Fare.max()

512.3292

Cuánto pagaron entre todos los pasajeros?

In [38]:
df.Fare.sum()

43550.4869

Filtra el dataframe para ver sólo a las mujeres

In [39]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [40]:
df[df.Sex == 'female']

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1
5,"Douglas, Mrs. Frederick Charles",female,27.0,1,1,1,PC 17558,247.5208,B58 B60,C,1
...,...,...,...,...,...,...,...,...,...,...,...
1289,"Dahlberg, Miss. Gerda Ulrika",female,22.0,3,0,0,7552,10.5167,NaN,S,0
1298,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.0,3,1,0,350046,7.8542,NaN,S,1
1300,"Connolly, Miss. Kate",female,30.0,3,0,0,330972,7.6292,NaN,Q,0
1302,"Cassebeer, Mrs. Henry Arthur Jr",female,NaN,1,0,0,17770,27.7208,NaN,C,1
1308,"McDermott, Miss. Brigdet Delia",female,NaN,3,0,0,330932,7.7875,NaN,Q,1

Filtra el dataframe para ver sólo a los niños (menores de 15 años)

In [46]:
df[df.Age <= 15]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
9,"Watt, Miss. Bertha J",female,12.00,2,0,0,C.A. 33595,15.7500,NaN,S,1
10,"Skoog, Miss. Mabel",female,9.00,3,3,2,347088,27.9000,NaN,S,0
35,"Sweet, Mr. George Frederick",male,14.00,2,0,0,220845,65.0000,NaN,S,0
44,"Ryerson, Master. John Borie",male,13.00,1,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,1
72,"Coutts, Master. William Loch ""William""",male,3.00,3,1,1,C.A. 37671,15.9000,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...,...
1243,"Nasser, Mrs. Nicholas",female,14.00,2,1,0,237736,30.0708,NaN,C,1
1261,"Johnson, Master. Harold Theodor",male,4.00,3,1,1,347742,11.1333,NaN,S,1
1291,"Richards, Master. George Sibley",male,0.83,2,1,1,29106,18.7500,NaN,S,1
1301,"Asplund, Master. Filip Oscar",male,13.00,3,4,2,347077,31.3875,NaN,S,0
1303,"Aks, Master. Philip Frank",male,0.83,3,0,1,392091,9.3500,NaN,S,1

Filtra el dataframe para ver sólo a mujeres y niños

In [47]:
df[(df.Sex == "female") | (df.Age < 15)]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,"Dean, Mrs. Bertram",female,33.00,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.00,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.00,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.00,2,0,0,W./C. 14258,10.5000,NaN,S,1
5,"Douglas, Mrs. Frederick Charles",female,27.00,1,1,1,PC 17558,247.5208,B58 B60,C,1
...,...,...,...,...,...,...,...,...,...,...,...
1300,"Connolly, Miss. Kate",female,30.00,3,0,0,330972,7.6292,NaN,Q,0
1301,"Asplund, Master. Filip Oscar",male,13.00,3,4,2,347077,31.3875,NaN,S,0
1302,"Cassebeer, Mrs. Henry Arthur Jr",female,NaN,1,0,0,17770,27.7208,NaN,C,1
1303,"Aks, Master. Philip Frank",male,0.83,3,0,1,392091,9.3500,NaN,S,1
1308,"McDermott, Miss. Brigdet Delia",female,NaN,3,0,0,330932,7.7875,NaN,Q,1

Quién era el pasajero más joven y qué edad tenía?

In [50]:
df.Age.min()

0.17

In [52]:
df[df.Age == df.Age.min()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
151,"Dean, Miss. Elizabeth Gladys Millvina",female,0.17,3,1,2,C.A. 2315,20.575,NaN,S,1

Cuántos pasajeros eran menores de 20? Qué porcentaje?

In [55]:
(df.Age < 20).sum()

225

In [58]:
(df.Age < 20).mean().round(3) * 100

17.2

Cual es el decil 9 de la edad?

In [60]:
import numpy as np

In [61]:
np.arange(0, 1.1, 0.1)

array([0. , 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1. ])

In [63]:
df.Age.quantile(np.arange(0, 1.1, 0.1))

0.0     0.17
0.1    14.00
0.2    19.00
0.3    22.00
0.4    25.00
0.5    28.00
0.6    31.00
0.7    36.00
0.8    42.00
0.9    50.00
1.0    80.00
Name: Age, dtype: float64

Cuánta gente sobrevivió? Cuánta murió?

Cuánta gente viajaba en cada clase?

Era más probable sobrevivir siendo de primera clase?

Era más probable sobrevivir siendo mujer?

Con cuántos familiares viajaba la gente? (informado en la columna SibSp)

Crear columna con división con denominador 0

Cuántas puertas de embarque había?

Crea un dataframe con las personas que viajaban en primera clase

Crea un dataframe que contenga mujeres y niños

Crea un dataframe con la gente que no viajara en la `S`

Crea un dataframe con todas las "Miss"

Crea una columna booleana que almacene si el pasajero es mayor de edad

Crea una columna con el año de nacimiento del pasajero

Afectó el número de familiares a la probabilidad de sobrevivir?

Eran más caros los billetes de primera clase?

Eran más jovenes los hombres que las mujeres del titanic?

Crea una columna que almacene si el número de ticket del pasajero contiene alguna letra. Define para ello una función y usa `apply`

Exporta los datos a un csv llamado `titanic_enriched.csv`